{
  "components": {
    "scheduler": {
      "_class_name": "DDIMScheduler",
      "_diffusers_version": "0.7.0.dev0",
      "_use_default_values": [
        "timestep_spacing",
        "dynamic_thresholding_ratio",
        "prediction_type",
        "sample_max_value",
        "clip_sample_range",
        "thresholding",
        "rescale_betas_zero_snr"
      ],
      "beta_end": 0.012,
      "beta_schedule": "scaled_linear",
      "beta_start": 0.00085,
      "clip_sample": false,
      "clip_sample_range": 1.0,
      "dynamic_thresholding_ratio": 0.995,
      "num_train_timesteps": 1000,
      "prediction_type": "epsilon",
      "rescale_betas_zero_snr": false,
      "sample_max_value": 1.0,
      "set_alpha_to_one": false,
      "skip_prk_steps": true,
      "steps_offset": 1,
      "thresholding": false,
      "timestep_spacing": "leading",
      "trained_betas": null
    },
    "text_encoder": {
      "_name_or_path": "/home/david-schutt/.cache/huggingface/hub/models--CompVis--stable-diffusion-v1-4/snapshots/133a221b8aa7292a167afc5127cb63fb5005638b/text_encoder",
      "add_cross_attention": false,
      "architectures": [
        "CLIPTextModel"
      ],
      "attention_dropout": 0.0,
      "bad_words_ids": null,
      "begin_suppress_tokens": null,
      "bos_token_id": 0,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "diversity_penalty": 0.0,
      "do_sample": false,
      "dropout": 0.0,
      "dtype": "float32",
      "early_stopping": false,
      "encoder_no_repeat_ngram_size": 0,
      "eos_token_id": 2,
      "exponential_decay_length_penalty": null,
      "finetuning_task": null,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "hidden_act": "quick_gelu",
      "hidden_size": 768,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "initializer_factor": 1.0,
      "initializer_range": 0.02,
      "intermediate_size": 3072,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "layer_norm_eps": 1e-05,
      "length_penalty": 1.0,
      "max_length": 20,
      "max_position_embeddings": 77,
      "min_length": 0,
      "model_type": "clip_text_model",
      "no_repeat_ngram_size": 0,
      "num_attention_heads": 12,
      "num_beam_groups": 1,
      "num_beams": 1,
      "num_hidden_layers": 12,
      "num_return_sequences": 1,
      "output_attentions": false,
      "output_hidden_states": false,
      "output_scores": false,
      "pad_token_id": 1,
      "prefix": null,
      "problem_type": null,
      "projection_dim": 512,
      "pruned_heads": {},
      "remove_invalid_values": false,
      "repetition_penalty": 1.0,
      "return_dict": true,
      "return_dict_in_generate": false,
      "sep_token_id": null,
      "suppress_tokens": null,
      "task_specific_params": null,
      "temperature": 1.0,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "top_k": 50,
      "top_p": 1.0,
      "torchscript": false,
      "transformers_version": "4.57.3",
      "typical_p": 1.0,
      "use_bfloat16": false,
      "vocab_size": 49408
    },
    "unet": {
      "_class_name": "UNet2DConditionModel",
      "_diffusers_version": "0.2.2",
      "_name_or_path": "/home/david-schutt/.cache/huggingface/hub/models--CompVis--stable-diffusion-v1-4/snapshots/133a221b8aa7292a167afc5127cb63fb5005638b/unet",
      "_use_default_values": [
        "addition_embed_type",
        "transformer_layers_per_block",
        "addition_time_embed_dim",
        "resnet_out_scale_factor",
        "class_embed_type",
        "time_embedding_type",
        "time_embedding_act_fn",
        "attention_type",
        "encoder_hid_dim",
        "dropout",
        "cross_attention_norm",
        "conv_out_kernel",
        "reverse_transformer_layers_per_block",
        "projection_class_embeddings_input_dim",
        "upcast_attention",
        "dual_cross_attention",
        "time_embedding_dim",
        "timestep_post_act",
        "class_embeddings_concat",
        "mid_block_type",
        "conv_in_kernel",
        "num_class_embeds",
        "resnet_skip_time_act",
        "addition_embed_type_num_heads",
        "use_linear_projection",
        "mid_block_only_cross_attention",
        "num_attention_heads",
        "resnet_time_scale_shift",
        "only_cross_attention",
        "time_cond_proj_dim",
        "encoder_hid_dim_type"
      ],
      "act_fn": "silu",
      "addition_embed_type": null,
      "addition_embed_type_num_heads": 64,
      "addition_time_embed_dim": null,
      "attention_head_dim": 8,
      "attention_type": "default",
      "block_out_channels": [
        320,
        640,
        1280,
        1280
      ],
      "center_input_sample": false,
      "class_embed_type": null,
      "class_embeddings_concat": false,
      "conv_in_kernel": 3,
      "conv_out_kernel": 3,
      "cross_attention_dim": 768,
      "cross_attention_norm": null,
      "down_block_types": [
        "CrossAttnDownBlock2D",
        "CrossAttnDownBlock2D",
        "CrossAttnDownBlock2D",
        "DownBlock2D"
      ],
      "downsample_padding": 1,
      "dropout": 0.0,
      "dual_cross_attention": false,
      "encoder_hid_dim": null,
      "encoder_hid_dim_type": null,
      "flip_sin_to_cos": true,
      "freq_shift": 0,
      "in_channels": 4,
      "layers_per_block": 2,
      "mid_block_only_cross_attention": null,
      "mid_block_scale_factor": 1,
      "mid_block_type": "UNetMidBlock2DCrossAttn",
      "norm_eps": 1e-05,
      "norm_num_groups": 32,
      "num_attention_heads": null,
      "num_class_embeds": null,
      "only_cross_attention": false,
      "out_channels": 4,
      "projection_class_embeddings_input_dim": null,
      "resnet_out_scale_factor": 1.0,
      "resnet_skip_time_act": false,
      "resnet_time_scale_shift": "default",
      "reverse_transformer_layers_per_block": null,
      "sample_size": 64,
      "time_cond_proj_dim": null,
      "time_embedding_act_fn": null,
      "time_embedding_dim": null,
      "time_embedding_type": "positional",
      "timestep_post_act": null,
      "transformer_layers_per_block": 1,
      "up_block_types": [
        "UpBlock2D",
        "CrossAttnUpBlock2D",
        "CrossAttnUpBlock2D",
        "CrossAttnUpBlock2D"
      ],
      "upcast_attention": false,
      "use_linear_projection": false
    },
    "vae": {
      "_class_name": "AutoencoderKL",
      "_diffusers_version": "0.2.2",
      "_name_or_path": "/home/david-schutt/.cache/huggingface/hub/models--CompVis--stable-diffusion-v1-4/snapshots/133a221b8aa7292a167afc5127cb63fb5005638b/vae",
      "_use_default_values": [
        "mid_block_add_attention",
        "force_upcast",
        "use_post_quant_conv",
        "norm_num_groups",
        "shift_factor",
        "latents_std",
        "latents_mean",
        "use_quant_conv"
      ],
      "act_fn": "silu",
      "block_out_channels": [
        128,
        256,
        512,
        512
      ],
      "down_block_types": [
        "DownEncoderBlock2D",
        "DownEncoderBlock2D",
        "DownEncoderBlock2D",
        "DownEncoderBlock2D"
      ],
      "force_upcast": true,
      "in_channels": 3,
      "latent_channels": 4,
      "latents_mean": null,
      "latents_std": null,
      "layers_per_block": 2,
      "mid_block_add_attention": true,
      "norm_num_groups": 32,
      "out_channels": 3,
      "sample_size": 512,
      "scaling_factor": 0.18215,
      "shift_factor": null,
      "up_block_types": [
        "UpDecoderBlock2D",
        "UpDecoderBlock2D",
        "UpDecoderBlock2D",
        "UpDecoderBlock2D"
      ],
      "use_post_quant_conv": true,
      "use_quant_conv": true
    }
  },
  "generated_utc": "2025-12-16T21:02:31.302395+00:00",
  "model_id": "CompVis/stable-diffusion-v1-4",
  "torch": "2.9.1+cu128"
}
